# Pandas pandera
* %pip install panderas

In [5]:
import pandas as pd
import pandera as pa

In [6]:
# we can use list for creating a seried in data frame

s1 : pd.Series = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# we can use Tuple for creating a seried in data frame

s1 : pd.Series = pd.Series((1,2,3,4,5))
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
# we can use Dictionary for creating a seried in data frame

s1 : pd.Series = pd.Series({'a': 10,
                            'b': 20,
                            'c': 30,
                            'd': 40,
                            'e': 50,
                            'f': 60,
                            'g': 70})
s1

a    10
b    20
c    30
d    40
e    50
f    60
g    70
dtype: int64

In [9]:
value : list[int] = [1, 2, 3, 4, 5]
index1: list[str] = ['a', 'b', 'c', 'd', 'e']

s1 : pd.Series = pd.Series(value, index=index1)
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
value : list[int] = [1, 2, 3, 4, 5]

index1: list[list[str]] = [['a1', 'a1', 'a1', 'b1', 'b1'],
                            ['a', 'b', 'c', 'd', 'e']]

s1 : pd.Series = pd.Series(value, index=index1)
s1

a1  a    1
    b    2
    c    3
b1  d    4
    e    5
dtype: int64

In [14]:
value : list[int] = [1, 2, 3, 4, 5]

index1: list[list[str]] = [['a1', 'a1', 'a1', 'b1', 'b1'],
                            ['a', 'b', 'c', 'd', 'e']]

s1 : pd.Series = pd.Series(value, index=index1, name='Student Data')
s1

a1  a    1
    b    2
    c    3
b1  d    4
    e    5
Name: Student Data, dtype: int64

In [19]:
import numpy as np
value : list[int] = [1, 2, 3, 4, 5]

index1: list[list[str]] = [['a1', 'a1', 'a1', 'b1', 'b1'],
                            ['a', 'b', 'c', 'd', 'e']]

s1 : pd.Series = pd.Series(value, index=index1, dtype=np.int32)
s1

a1  a    1
    b    2
    c    3
b1  d    4
    e    5
dtype: int32

In [20]:
from nptyping import DataFrame, Structure as S
s1 : S['abc: str'] = pd.Series(['a','b','c'])

In [21]:
#data to validate
df = pd.DataFrame({
    'colum1' : [1, 4, 0, 10, 9],
    'colum2' : [-1.3, -1.4, -2.9, -10.1, -20.4],
    'colum3' : ['value_1', 'value_2', 'value_3', 'value_2', 'value_1'],
})
# define schema
schema = pa.DataFrameSchema({
    'colum1' : pa.Column(int, checks=pa.Check.le(10)),
    'colum2' : pa.Column(float, checks=pa.Check.lt(-1.2)),
    'colum3' : pa.Column(str, checks=[pa.Check.str_startswith('value_'),
                                      pa.Check(lambda s: s.str.split('_', expand=True).shape[1]== 2)
                                      ]),
})
validated_df = schema(df)
print (validated_df)

   colum1  colum2   colum3
0       1    -1.3  value_1
1       4    -1.4  value_2
2       0    -2.9  value_3
3      10   -10.1  value_2
4       9   -20.4  value_1

# Data Frame

In [25]:
s1 : pd.Series = pd.Series([1, 2, 3, 4, 5], name = 'Student id')
s2 : pd.Series = pd.Series([10, 20, 30, 40, 50], name = 'Student score')
s3 : pd.Series = pd.Series(['Ali', 'Hamza', 'Khan', 'Muhammad','Sarwar'],name = 'Student Name')
# key
# value : iterable
# length should be same as length of other series
df1 : pd.DataFrame = pd.DataFrame({'Student id':s1, 'Student score':s2, 'Student Name':s3})
df1

   Student id  Student score Student Name
0           1             10          Ali
1           2             20        Hamza
2           3             30         Khan
3           4             40     Muhammad
4           5             50       Sarwar

In [27]:
s1 : pd.Series = pd.Series([1, 2, 3, 4, 5], name = 'Student id')
s2 : pd.Series = pd.Series([10, 20, 30, 40, 50], name = 'Student score')
s3 : pd.Series = pd.Series(['Ali', 'Hamza', 'Khan', 'Muhammad','Sarwar'],name = 'Student Name')

df1 : pd.DataFrame = pd.concat([s1, s2, s3], axis = 1)
#pd.DataFrame({'Student id':s1, 'Student score':s2, 'Student Name':s3})
df1

   Student id  Student score Student Name
0           1             10          Ali
1           2             20        Hamza
2           3             30         Khan
3           4             40     Muhammad
4           5             50       Sarwar

In [30]:
s1 : pd.Series = pd.Series([1, 2, 3, 4, 5], name = 'Student id')
s2 : pd.Series = pd.Series([10, 20, 30, 40, 50], name = 'Student score')
s3 : pd.Series = pd.Series(['Ali', 'Hamza', 'Khan', 'Muhammad','Sarwar'],name = 'Student Name')

df1 : pd.DataFrame = pd.concat([s1, s2, s3], axis = 1)
#pd.DataFrame({'Student id':s1, 'Student score':s2, 'Student Name':s3})
df1

   Student id  Student score Student Name
0           1             10          Ali
1           2             20        Hamza
2           3             30         Khan
3           4             40     Muhammad
4           5             50       Sarwar

In [31]:
data :list [list[int]] =[[1, 2, 3,],
                         [4, 5, 6,],
                         [7, 8, 9]]
df : pd.DataFrame = pd.DataFrame(data)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [32]:
data :list [list[int]] =[[1, 2, 3,],
                         [4, 5, 6,],
                         [7, 8, 9]]
df : pd.DataFrame = pd.DataFrame(data, columns = ['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [34]:
data :list [list[int]] =[[1, 2, 3,],
                         [4, 5, 6,],
                         [7, 8, 9]]
df : pd.DataFrame = pd.DataFrame(data,  columns = ['A', 'B', 'C'], index = ['X', 'Y', 'Z'])
df

   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9

In [37]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [39]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [40]:
df.index

Index(['X', 'Y', 'Z'], dtype='object')

In [42]:
from nptyping import  NDArray, Shape, UInt64
from typing import Any

data : NDArray[Shape["Size"], Any] = np.arange(10*10).reshape(10, 10)
data

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]])

In [43]:
from nptyping import  NDArray, Shape, UInt64
from typing import Any

data : NDArray[Shape["Size"], Any] = np.arange(10*10).reshape(10, 10)
df : pd.DataFrame = pd.DataFrame (data, columns = list ("ABCDEFGHIJ"))
df

    A   B   C   D   E   F   G   H   I   J
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [44]:
df1 : list[pd.DataFrame] = pd.read_html("https://www.w3schools.com/python/python_operators.asp")
df1

[  Operator            Name Example    Try it
 0        +        Addition   x + y  Try it »
 1        -     Subtraction   x - y  Try it »
 2        *  Multiplication   x * y  Try it »
 3        /        Division   x / y  Try it »
 4        %         Modulus   x % y  Try it »
 5       **  Exponentiation  x ** y  Try it »
 6       //  Floor division  x // y  Try it »,
    Operator        Example         Same As    Try it
 0         =          x = 5           x = 5  Try it »
 1        +=         x += 3       x = x + 3  Try it »
 2        -=         x -= 3       x = x - 3  Try it »
 3        *=         x *= 3       x = x * 3  Try it »
 4        /=         x /= 3       x = x / 3  Try it »
 5        %=         x %= 3       x = x % 3  Try it »
 6       //=        x //= 3      x = x // 3  Try it »
 7       **=        x **= 3      x = x ** 3  Try it »
 8        &=         x &= 3       x = x & 3  Try it »
 9        |=         x |= 3       x = x | 3  Try it »
 10       ^=         x ^= 3       x = x ^ 3  Try it »
 11      >>=        x >>= 3      x = x >> 3  Try it »
 12      <<=        x <<= 3      x = x << 3  Try it »
 13       :=  print(x := 3)  x = 3 print(x)  Try it »,
   Operator                      Name Example    Try it
 0       ==                     Equal  x == y  Try it »
 1       !=                 Not equal  x != y  Try it »
 2        >              Greater than   x > y  Try it »
 3        <                 Less than   x < y  Try it »
 4       >=  Greater than or equal to  x >= y  Try it »
 5       <=     Less than or equal to  x <= y  Try it »,
   Operator                                        Description  \
 0      and           Returns True if both statements are true
 1       or      Returns True if one of the statements is true
 2      not  Reverse the result, returns False if the resul...

                  Example    Try it
 0       x < 5 and x < 10  Try it »
 1         x < 5 or x < 4  Try it »
 2  not(x < 5 and x < 10)  Try it »  ,
   Operator                                        Description     Example  \
 0       is  Returns True if both variables are the same ob...      x is y
 1   is not  Returns True if both variables are not the sam...  x is not y

      Try it
 0  Try it »
 1  Try it »  ,
   Operator                                        Description     Example  \
 0       in  Returns True if a sequence with the specified ...      x in y
 1   not in  Returns True if a sequence with the specified ...  x not in y

      Try it
 0  Try it »
 1  Try it »  ,
   Operator                  Name  \
 0        &                   AND
 1        |                    OR
 2        ^                   XOR
 3        ~                   NOT
 4       <<  Zero fill left shift
 5       >>    Signed right shift

                                          Description Example    Try it
 0              Sets each bit to 1 if both bits are 1   x & y  Try it »
 1         Sets each bit to 1 if one of two bits is 1   x | y  Try it »
 2    Sets each bit to 1 if only one of two bits is 1   x ^ y  Try it »
 3                               Inverts all the bits      ~x  Try it »
 4  Shift left by pushing zeros in from the right ...  x << 2  Try it »
 5  Shift right by pushing copies of the leftmost ...  x >> 2  Try it »  ,
                                Operator  \
 0                                    ()
 1                                    **
 2                              +x -x ~x
 3                              * / // %
 4                                   + -
 5                                 << >>
 6                                     &
 7                                     ^
 8                                     |
 9   == != > >= < <= is is not in not in
 10                                  not
 11                                  and
 12                                   or

                                           Description    Try it
 0                                         Parentheses  Try it »
 1                                      Exponentiation  Try it »
 2            Unary plus, unary minus, and bitwise NOT  Try it »
 3   Multiplication, division, floor division, and ...  Try it »
 4                            Addition and subtraction  Try it »
 5                       Bitwise left and right shifts  Try it »
 6                                         Bitwise AND  Try it »
 7                                         Bitwise XOR  Try it »
 8                                          Bitwise OR  Try it »
 9     Comparisons, identity, and membership operators  Try it »
 10                                        Logical NOT  Try it »
 11                                                AND  Try it »
 12                                                 OR  Try it »  ]

In [45]:
df1[0]

  Operator            Name Example    Try it
0        +        Addition   x + y  Try it »
1        -     Subtraction   x - y  Try it »
2        *  Multiplication   x * y  Try it »
3        /        Division   x / y  Try it »
4        %         Modulus   x % y  Try it »
5       **  Exponentiation  x ** y  Try it »
6       //  Floor division  x // y  Try it »

In [47]:
df1[6]

,Operator,Name,Description,Example,Try it
0,&,AND,Sets each bit to 1 if both bits are 1,x & y,Try it »
1,|,OR,Sets each bit to 1 if one of two bits is 1,x | y,Try it »
2,^,XOR,Sets each bit to 1 if only one of two bits is 1,x ^ y,Try it »
3,~,NOT,Inverts all the bits,~x,Try it »
4,<<,Zero fill left shift,Shift left by pushing zeros in from the right ...,x << 2,Try it »
5,>>,Signed right shift,Shift right by pushing copies of the leftmost ...,x >> 2,Try it »

In [48]:
df2 : pd.DataFrame = pd.read_json("https://www.w3schools.com/python/pandas/data.js")
df2

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [49]:
dir(pa.Check)

['__call__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slotnames__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_get_check_fn_code',
 'between',
 'eq',
 'equal_to',
 'equal_to',
 'from_builtin_check_name',
 'ge',
 'get_backend',
 'get_builtin_check_fn',
 'greater_than',
 'greater_than',
 'greater_than_or_equal_to',
 'greater_than_or_equal_to',
 'gt',
 'in_range',
 'in_range',
 'isin',
 'isin',
 'le',
 'less_than',
 'less_than',
 'less_than_or_equal_to',
 'less_than_or_equal_to',
 'lt',
 'ne',
 'not_equal_to',
 'not_equal_to',
 'notin',
 'notin',
 'one_sample_ttest',
 'register_backend',
 'register_builtin_check_fn',
 'str_contains',
 'str_contains',
 'str_endswith',
 'str_endswith',
 'str_length',
 'str_length',
 'str_matches',
 'str_matches',
 'str_startswith',
 'str_startswith',
 'two_sample_ttest',
 'unique_values_eq',
 'unique_values_eq']

# Siclicing and indexing
 * series_variable[index]
 * DataFrame [list[row_index]]
  * loc
  * iloc
  * at
  * iat

In [50]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5])
display (s1)
print ("Apply Scilicing")
display (s1[1]) # index

0    1
1    2
2    3
3    4
4    5
dtype: int64

Apply Scilicing

2

In [51]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5])
display (s1)
print ("Apply Scilicing")
display (s1[1:4]) # index

0    1
1    2
2    3
3    4
4    5
dtype: int64

Apply Scilicing

1    2
2    3
3    4
dtype: int64

In [52]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5])
display (s1)
print ("Apply Scilicing")
display (s1.iloc[1:5]) # index location same as numpy sclicings

0    1
1    2
2    3
3    4
4    5
dtype: int64

Apply Scilicing

1    2
2    3
3    4
4    5
dtype: int64

In [53]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
display (s1)
print ("Apply Scilicing")
display (s1.iloc[1:3]) # index location will ignore number 0-9

a    1
b    2
c    3
d    4
e    5
dtype: int64

Apply Scilicing

b    2
c    3
dtype: int64

In [54]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
display (s1)
print ("Apply Scilicing")
display (s1.loc['a':'d']) # index location with letters and labels end always include

a    1
b    2
c    3
d    4
e    5
dtype: int64

Apply Scilicing

a    1
b    2
c    3
d    4
dtype: int64

In [55]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
display (s1)
print ("Apply Scilicing")
display (s1.iat[1]) # index location with single number and update as well

a    1
b    2
c    3
d    4
e    5
dtype: int64

Apply Scilicing

2

In [56]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
display (s1)
print ("Apply Scilicing")
display (s1.at['c']) # index location with single number and update as well

a    1
b    2
c    3
d    4
e    5
dtype: int64

Apply Scilicing

3

# Regex
 * https://docs.python.org/3/library/re.html

In [59]:
import re
x: str = """
21:432:06 From Abdul Khalid to Everyone:
PIAIC-604031
"""
# patterns : str = r''' 
#\d{2}:\d{2}:\d{2} From (.*) to Everyone:
# PIAIC-? ?\d{5,6}
#'''
patterns: str = r'''
\d{2}:\d{2}:\d{2} From (.*) to Everyone:\s*\n(PIAIC-?\s?\d{5,6})
'''

#data = re.findall(patterns, x, re.MULTILINE | re.DOTALL)
#print(data)


data : list[list[str]] = re.findall(patterns, x)
print(data)

[]